import java.util.Scanner;

public class TheSongOfTheWheels {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        boolean isFound = false;
        String password = "";
        int countPass = 0, count = 0;
        int num = Integer.parseInt(scanner.nextLine());

        for (int i = 1; i <= 9; i++) {
            for (int j = 1; j <= 9; j++) {
                for (int k = 1; k <= 9; k++) {
                    for (int l = 1; l <= 9; l++) {
                        count++;
                        if (i * j + k * l == num) {
                            if (i < j && k > l) {
                                System.out.printf("%d%d%d%d ", i, j, k, l);
                                countPass++;
                                if (countPass == 4) {
                                    password = String.format("%d%d%d%d", i, j, k, l);
                                    isFound = true;
                                }
                            }
                        }
                    }
                }
            }
        }
        if (isFound) {
            System.out.println();
            System.out.println("Password: " + password);
        } else if (!isFound && countPass != 0) {
            System.out.println();
            System.out.println("No!");
        } else if (!isFound) {
            System.out.println("No!");
        }
    }
}
/*Прапраправнукът на Сали Яшар е получил наследство - сейф с парола - четири цифри. В него е заключена тайната на
пеещите каруци. Той има автосервиз и се нуждае от реклама, затова е решил да направи такава каруца. Проблема е,
че паролата е скрита в следната задача:
„Парола ще получиш, ако знаеш  едно цяло число, контролна стойност  се нарича то,
почива в интервала от 4 до 144 включително, но да го откриеш може би ще е мъчително. ”
Паролата има формат: "abcd" и контролната стойност трябва да е равна на  a*b + c*d , но трябва да бъдат спазени
следните условия:
•	при намирането на а и b: a < b
•	при намиране на  c и d: c > d
•	a, b, c и d са числа в интервала [1 - 9]
Каруцата  има четири колела, затова паролата ще е четвърто число, което трябва да се отпечата.
В случай, че НЕ се намери такова число,  отпечатва се „No!“.
Вход
От конзолата се чете едно цяло число (контролната стойност): M – цяло число в интервала [4 … 144];
Изход
Отпечатването на конзолата зависи от резултата:
•	Ако са намерени четворки числа (аbcd), отговарящи на условието, ги отпечатваме всичките с разделител интервал:
“{а}{b}{c}{d} ”
•	Отпечатва се един от двата реда на нов ред:
•	Ако съществува четвърта четворка се отпечатва: „Password: {а}{b}{c}{d}“
•	Ако НЕ са намерени такива числа или няма  четвърта четворка отпечатваме: “No!”
*/